#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-303946/global/networks/main-vpc]
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-303946/artifactregistry.googleapis.com]
data.google_client_config.provider: Reading...
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-303946-data]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-303946-code]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-303946"/regions/"europe-west1"/zones/<null>]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-303946-code-spark-job.py]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-303946/global/firewalls/fw-allow-ingress-iap]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-303946/global/firewalls/allow-all-internal]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-303946/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-303946/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-303946/regions/europe-west1/subnetworks/subnet-01]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-303946/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-303946/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-303946/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-303946/composer.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-303946/serviceAccounts/tbd-2024l-303946-data@tbd-2024l-303946.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-303946/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-303946/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-303946-data@tbd-2024l-303946.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-303946/roles/composer.worker/serviceAccount:tbd-2024l-303946-data@tbd-2024l-303946.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-303946-data/roles/storage.objectUser/serviceAccount:tbd-2024l-303946-data@tbd-2024l-303946.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-303946-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-303946-data@tbd-2024l-303946.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-303946/roles/dataproc.editor/serviceAccount:tbd-2024l-303946-data@tbd-2024l-303946.iam.gserviceaccount.com]
module.composer.module.composer.data.google_project.project: Reading...
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-303946/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-303946/regions/europe-west1/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 0s [id=projects/tbd-2024l-303946]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-303946/roles/composer.ServiceAgentV2Ext/serviceAccount:service-611727548048@cloudcomposer-accounts.iam.gserviceaccount.com]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:23eb9d244e166292277c1fec600e9c5becfa14914c78541c9741b2f0a6465c1deu.gcr.io/tbd-2024l-303946/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:50b6220d41a7d2a917e3a1a0c7edb366948098da0d6c4c95f9e67ebb1564284a]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-303946/notebooks.googleapis.com]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-303946-conf]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-303946/roles/iam.serviceAccountTokenCreator]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2024l-303946/locations/europe-west1/environments/demo-lab]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-303946-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-303946-conf-scripts/notebook_post_startup_script.sh]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-f166a1a5-bucket-dags/dbt-dag.py]
data.google_container_cluster.composer-gke-cluster: Reading...
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-f166a1a5-bucket-dags/data-dag.py]
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:484341dd12e82f8a039f6019dca1195e2478ad633eacfbd7fbd0a2ccf694d500eu.gcr.io/tbd-2024l-303946/dbt:1.7.3]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:50f2027d88f806c2322de86d38b0fe114ec609a9c4857c1b9ab0b2f08250e019]
data.google_container_cluster.composer-gke-cluster: Read complete after 3s [id=projects/tbd-2024l-303946/locations/europe-west1/clusters/europe-west1-demo-lab-f166a1a5-gke]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id       = "sha256:484341dd12e82f8a039f6019dca1195e2478ad633eacfbd7fbd0a2ccf694d500eu.gcr.io/tbd-2024l-303946/dbt:1.7.3"
      - name     = "eu.gcr.io/tbd-2024l-303946/dbt:1.7.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:23eb9d244e166292277c1fec600e9c5becfa14914c78541c9741b2f0a6465c1deu.gcr.io/tbd-2024l-303946/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2024l-303946/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster will be updated in-place
  ~ resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
        id                            = "projects/tbd-2024l-303946/regions/europe-west1/clusters/tbd-cluster"
        name                          = "tbd-cluster"
        # (6 unchanged attributes hidden)

      ~ cluster_config {
            # (2 unchanged attributes hidden)

          ~ preemptible_worker_config {
                # (3 unchanged attributes hidden)

              ~ instance_flexibility_policy {
                  + instance_selection_results = []
                }

                # (1 unchanged block hidden)
            }

          ~ worker_config {
              ~ num_instances     = 2 -> 0
                # (5 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (5 unchanged blocks hidden)
        }
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-303946/dbt:1.7.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.3"
              + "PROJECT_NAME"      = "tbd-2024l-303946"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/dbt_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-303946/dbt:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-303946/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.3"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-303946"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-303946/jupyter:latest",
            ]
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-303946"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook will be created
  + resource "google_notebooks_instance" "tbd_notebook" {
      + create_time            = (known after apply)
      + desired_state          = "ACTIVE"
      + disk_encryption        = (known after apply)
      + effective_labels       = (known after apply)
      + id                     = (known after apply)
      + instance_owners        = [
          + "mikolajpater123@gmail.com",
        ]
      + location               = "europe-west1-b"
      + machine_type           = "e2-standard-2"
      + metadata               = {
          + "notebook-disable-root" = "true"
          + "vmDnsSetting"          = "GlobalDefault"
        }
      + name                   = "tbd-2024l-303946-notebook"
      + network                = "projects/tbd-2024l-303946/global/networks/main-vpc"
      + no_proxy_access        = true
      + no_public_ip           = true
      + post_startup_script    = "gs://tbd-2024l-303946-conf/scripts/notebook_post_startup_script.sh"
      + project                = "tbd-2024l-303946"
      + proxy_uri              = (known after apply)
      + service_account        = (known after apply)
      + service_account_scopes = (known after apply)
      + state                  = (known after apply)
      + subnet                 = "projects/tbd-2024l-303946/regions/europe-west1/subnetworks/subnet-01"
      + tags                   = (known after apply)
      + terraform_labels       = (known after apply)
      + update_time            = (known after apply)

      + container_image {
          + repository = "eu.gcr.io/tbd-2024l-303946/jupyter"
          + tag        = "3.6.3"
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = true
          + enable_secure_boot          = true
          + enable_vtpm                 = true
        }
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-303946/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:611727548048-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-303946-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:611727548048-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mpater59, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*